ainhoamm04/Asistente_lectura_ESP32-S3/src/main.cpp
#include <Arduino.h>
#include "display.h"
#include <lvgl.h>
#include "Freenove_WS2812_Lib_for_ESP32.h"
#include "lv_img.h"
#include "firebase_config.h"
#include <Firebase_ESP_Client.h>
#include <ArduinoJson.h>

// El fabricante me indica que este es el modelo del kit
#define CAMERA_MODEL_ESP32S3_EYE \
  {                                 \
    .PWDN_GPIO_NUM = -1,             \
    .RESET_GPIO_NUM = -1,           \
    .XCLK_GPIO_NUM = 15,            \
    .SIOD_GPIO_NUM = 4,            \
    .SIOC_GPIO_NUM = 5,            \
    .Y9_GPIO_NUM = 16,              \
    .Y8_GPIO_NUM = 17,              \
    .Y7_GPIO_NUM = 18,              \
    .Y6_GPIO_NUM = 12,              \
    .Y5_GPIO_NUM = 10,               \
    .Y4_GPIO_NUM = 8,              \
    .Y3_GPIO_NUM = 9,              \
    .Y2_GPIO_NUM = 11,              \
    .VSYNC_GPIO_NUM = 6,           \
    .HREF_GPIO_NUM = 7,            \
    .PCLK_GPIO_NUM = 13,            \
  }

#include <ESP32QRCodeReader.h>

// Definición aquí (en lugar de platformio.ini) para que no de error al definir el strip
// Para controlar el LED WS2812
#define LEDS_COUNT 1
#define LEDS_PIN 48
#define CHANNEL 0

//-------------------------DECLARACIÓN DE VARIABLES Y FUNCIONES------------------------------------
Display screen;

ESP32QRCodeReader reader(CAMERA_MODEL_ESP32S3_EYE);
String qrCodeContentGlobal;
TaskHandle_t qrCodeTaskHandle;
static int qr_task_flag = 0;
void onQrCodeTask(void *pvParameters);
void create_qr_task(void);
void stop_qr_task(void);
bool qrCodeFound = false;

bool book_found = false;
String book_key;
String title;
String author;
int totalPages;
int currentPage;

Freenove_ESP32_WS2812 strip = Freenove_ESP32_WS2812(LEDS_COUNT, LEDS_PIN, CHANNEL, TYPE_GRB);

lv_obj_t *scr_principal;

void tab_function(void);
void back_to_main_menu(lv_event_t * e);
void tabview_event_handler(lv_event_t * e);

void tab1_content(lv_obj_t * parent);
void create_second_screen_tab1(lv_obj_t * parent);
void go_to_screen2_tab1(lv_event_t * e);

void tab2_content(lv_obj_t * parent);
void create_second_screen_tab2(lv_obj_t * parent, const std::string& key);
void go_to_screen2_tab2(lv_event_t * e);

void tab3_content(lv_obj_t * parent);
void create_second_screen_tab3(lv_obj_t * parent);
void go_to_screen2_tab3(lv_event_t * e);
void searchIsbnInDatabase(const String& qrCodeContent);
void keyboard_event_cb(lv_event_t * e);
void create_keyboard_screen(lv_obj_t * parent);
void show_numeric_keyboard(lv_obj_t * label);

void tab4_content(lv_obj_t * parent);
void create_second_screen_tab4(lv_obj_t * parent);
void go_to_screen2_tab4(lv_event_t * e);
void event_handler_scroll1(lv_event_t * e);
void event_handler_scroll2(lv_event_t * e);
void event_handler_scroll3(lv_event_t * e);
void event_handler_bottom(lv_event_t * e);
void event_handler_top(lv_event_t * e);
void draw_label_x_axis(lv_event_t * e);
void draw_label_y_axis(lv_event_t * e);

// Enumeración para los diferentes estilos de títulos
typedef enum {
    TITLE_STYLE_PURPLE,
    TITLE_STYLE_BLUE,
    TITLE_STYLE_ORANGE,
    TITLE_STYLE_GREEN
} title_style;
void general_title(lv_obj_t * parent, const char * titulo, title_style style);

// Enumeración para los diferentes estilos de botones
typedef enum {
    BUTTON_STYLE_PURPLE,
    BUTTON_STYLE_BLUE,
    BUTTON_STYLE_ORANGE,
    BUTTON_STYLE_GREEN
} button_style;
void create_button(lv_obj_t * parent, lv_obj_t * label, button_style style, lv_event_cb_t event_cb, lv_coord_t pos_x, lv_coord_t pos_y);


//----------------------------------SETUP------------------------------------
void setup() {
    // Inicialización de la comunicación serial a 115200 baudios (comunicación entre la placa y PC a través del puerto serie)
    Serial.begin(115200);

    // Inicialización de la pantalla
    screen.init();

    // Inicialización de Firebase (conexión con base de datos)
    setup_firebase();

    // Configuración de pestañas interfaz gráfica
    tab_function();

    // Inicialización del lector de QR
    reader.setup();
    Serial.println("Setup QRCode Reader");

    // Inicialización del LED
    strip.begin();
    strip.setBrightness(255);
}



//------------------------------------LOOP------------------------------------------
void loop() {
    // Para mantener la interfaz gráfica actualizada
    screen.routine();
    delay(5);

    // Cuando se decodifica el QR se busca en la base de datos y se muestra la información
    if (qrCodeFound) {
        qrCodeFound = false;
        Serial.println(qrCodeContentGlobal);
        searchIsbnInDatabase(qrCodeContentGlobal);
        create_keyboard_screen(lv_scr_act());
    }
}



//---------------------------DEFINICIÓN DE FUNCIONES------------------------------------
lv_obj_t * tab1;
lv_obj_t * tab2;
lv_obj_t * tab3;
lv_obj_t * tab4;

void tab_function(void)
{
    // Crear un objeto de vista de pestañas
    lv_obj_t * tabview = lv_tabview_create(lv_scr_act(), LV_DIR_TOP, 35);

    // Agregar 4 pestañas al objeto de vista de pestañas
    tab1 = lv_tabview_add_tab(tabview, "\xF3\xB0\x8B\x9C");
    tab2 = lv_tabview_add_tab(tabview, "\xF3\xB1\x89\x9F");
    tab3 = lv_tabview_add_tab(tabview, "\xF3\xB0\x81\xB2");
    tab4 = lv_tabview_add_tab(tabview, "\xF3\xB0\x84\xA8");

    // Obtener los botones de pestañas para aplicarles estilo de fuente
    lv_obj_t * tab_btns = lv_tabview_get_tab_btns(tabview);
    lv_obj_set_style_text_font(tab_btns, &bigger_symbols, 0);

    // Estilo pantalla principal pestaña 1
    lv_obj_set_style_radius(tab1, 4,0);
    lv_obj_set_style_bg_opa(tab1, LV_OPA_30, 0);
    lv_obj_set_style_bg_color(tab1, lv_palette_lighten(LV_PALETTE_PURPLE, 1), 0);
    lv_obj_set_style_border_width(tab1, 4, 0);
    lv_obj_set_style_border_color(tab1, lv_color_make(155, 4, 207), 0);

    // Estilo pantalla principal pestaña 2
    lv_obj_set_style_radius(tab2, 4,0);
    lv_obj_set_style_bg_opa(tab2, LV_OPA_30, 0);
    lv_obj_set_style_bg_color(tab2, lv_color_hex(0x6CE0FF), 0);
    lv_obj_set_style_border_width(tab2, 4, 0);
    lv_obj_set_style_border_color(tab2, lv_color_make(10, 154, 254), 0);

    // Estilo pantalla principal pestaña 3
    lv_obj_set_style_radius(tab3, 4,0);
    lv_obj_set_style_bg_opa(tab3, LV_OPA_60, 0);
    lv_obj_set_style_bg_color(tab3, lv_palette_lighten(LV_PALETTE_ORANGE, 1), 0);
    lv_obj_set_style_border_width(tab3, 4, 0);
    lv_obj_set_style_border_color(tab3, lv_color_make(255, 104, 0), 0);

    // Estilo pantalla principal pestaña 4
    lv_obj_set_style_radius(tab4, 4,0);
    lv_obj_set_style_bg_opa(tab4, LV_OPA_30, 0);
    lv_obj_set_style_bg_color(tab4, lv_palette_lighten(LV_PALETTE_LIGHT_GREEN, 1), 0);
    lv_obj_set_style_border_width(tab4, 4, 0);
    lv_obj_set_style_border_color(tab4, lv_color_make(30, 217, 0), 0);

    // Funciones para el contenido de las pestañas
    tab1_content(tab1);
    tab2_content(tab2);
    tab3_content(tab3);
    tab4_content(tab4);

    // Agrega un manejador de eventos a la vista de pestañas para manejar el cambio de pestaña
    lv_obj_add_event_cb(tabview, tabview_event_handler, LV_EVENT_VALUE_CHANGED, NULL);
}

// Para actulizar el contenido de la pantalla principal de las pestañas 2 y 4
void tabview_event_handler(lv_event_t * e) {
    // Obtener la vista de pestañas que disparó el evento
    lv_obj_t * tabview = lv_event_get_target(e);

    // Obtener la pestaña activa (seleccionada)
    uint16_t tab = lv_tabview_get_tab_act(tabview);

    // Si la pestaña 2 está seleccionada (los índices de las pestañas comienzan en 0)
    if (tab == 1) {
        // Limpiar el contenido para volver a cargarlo actualizado
        lv_obj_clean(tab2);
        tab2_content(tab2);
        //Serial.println("Tab 2");
    }
    // Si la pestaña 4 está seleccionada
    else if (tab == 3) {
        lv_obj_clean(tab4);
        tab4_content(tab4); // Llama a tab4_content
        //Serial.println("Tab 4");
    }
}



//---------------------------------Funciones generales------------------------------------------
// Función a la que llaman los botones de las pantallas secundarias para volver a la principal de la tab activa
void back_to_main_menu(lv_event_t * e) {
    lv_obj_t * current_screen = lv_obj_get_parent(lv_event_get_target(e)); // Obtener la pantalla actual (secundaria)
    lv_scr_load(scr_principal); // Cargar la pantalla principal (donde están las tabs)
    lv_obj_del(current_screen); // Eliminar la pantalla secundaria
}


