ainhoamm04/Asistente_lectura_ESP32-S3/src/main.cpp
    create_button(parent, symbol, BUTTON_STYLE_PURPLE, go_to_screen2_tab1, 75, 180);
}

// Nueva pantalla con información adicional sobre el funcionamiento de la interfaz de usuario
void create_second_screen_tab1(lv_obj_t * parent) {
    lv_obj_t * screen2 = lv_obj_create(NULL); // Objeto que se utilizará para cargar la nueva pantalla
    lv_obj_set_size(screen2, LV_HOR_RES, LV_VER_RES);
    lv_obj_set_style_bg_color(screen2, lv_color_hex(0xE9AAFF), 0);
    lv_scr_load(screen2); // Cargar la nueva pantalla

    // Definir los textos de las etiquetas y sus posiciones Y en un array
    const char *textos[] = {
            "#8035A8 ¡HOLA!# " "#8035A8 \xEE\xAD\x94#",
            "Soy una herramienta para que puedas registrar de manera interactiva tus lecturas a través de mi cámara",
            "---------------------------------------",
            "\xF3\xB1\x89\x9F",
            "Aquí podrás almacenar los libros que estés leyendo",
            "\xF3\xB0\x81\xB2",
            "Aquí podrás registrar tus nuevos libros. Para ello deberás mostrar a la cámara el QR asignado a cada libro",
            "\xF3\xB0\x84\xA8",
            "Aquí podrás comprobar tu avance con la lectura"
    };
    const int posicionesY[] = {20, 60, 150, 180, 210, 275, 305, 410, 440};

    // Crear y configurar las etiquetas en un bucle
    for(int i = 0; i < sizeof(textos) / sizeof(textos[0]); i++) {
        lv_obj_t *label = lv_label_create(screen2);
        lv_label_set_long_mode(label, LV_LABEL_LONG_WRAP);
        lv_label_set_recolor(label, true);
        lv_label_set_text(label, textos[i]);
        lv_obj_set_style_text_font(label, &ubuntu_regular_16, 0);
        lv_obj_set_width(label, 215);
        lv_obj_set_style_text_align(label, LV_TEXT_ALIGN_CENTER, 0);
        lv_obj_align(label, LV_ALIGN_TOP_MID, 0, posicionesY[i]);

        // Aplicar la fuente más grande a las etiquetas con símbolos
        if(i == 0 || i == 3 || i == 5 || i == 7) {
            lv_obj_set_style_text_font(label, &bigger_symbols, 0);
        }
    }

    // Botón con símbolo para ir a la pantalla principal de la pestaña 1
    lv_obj_t * symbol = lv_label_create(screen2);
    lv_label_set_text(symbol, "\xF3\xB0\xA9\x88");
    lv_obj_set_style_text_font(symbol, &bigger_symbols, 0);

    create_button(screen2, symbol, BUTTON_STYLE_PURPLE, back_to_main_menu, 95, 510);

    lv_obj_t * space = lv_label_create(screen2);
    lv_label_set_text(space, "\n\n");
    lv_obj_align(space, LV_ALIGN_TOP_MID, 0, 510);
}

// Manejador de eventos para el botón que cambia a la pantalla secundaria de tab1
void go_to_screen2_tab1(lv_event_t * e) {
    lv_obj_t * main_screen = lv_scr_act(); //Obtener la pantalla principal (donde están las tabs)
    scr_principal = main_screen; //Guardar la pantalla principal en una variable global
    create_second_screen_tab1(main_screen); //Cargar la pantalla secundaria
}






//--------------------------------------PESTAÑA 2---------------------------------------------------
// Generación de estructura para hacer más fácil el manejo de los libros para ordenarlos
struct Book {
    String title;
    String key;
    long long timestamp;
};

// Pantalla principal de la pestaña 2 (es dinámica y está sincronizada con la base de datos)
void tab2_content(lv_obj_t * parent) {
    // Título
    general_title(parent, "MIS LIBROS", TITLE_STYLE_BLUE);

    // Crear la lista donde se mostrarán los libros
    lv_obj_t * list = lv_list_create(parent);

    // Estilo para la lista
    static lv_style_t style_blue;
    lv_style_init(&style_blue);
    lv_style_set_bg_color(&style_blue, lv_color_hex(0xCBECFF));
    lv_style_set_border_width(&style_blue, 0);
    lv_style_set_border_color(&style_blue, lv_color_make(10, 154, 254));
    lv_style_set_radius(&style_blue, 1);

    // Aplicar el estilo a la lista
    lv_obj_add_style(list, &style_blue , LV_STATE_DEFAULT);

    // Obtener los datos de los libros de la base de datos
    DynamicJsonDocument doc = get_book_data();
    if (!doc.isNull()) {
        // Obtener el número de libros y calcular la altura de la lista
        int num_books = doc.as<JsonObject>().size();
        int list_height = num_books * 40;
        lv_obj_set_size(list, 230, list_height);
        lv_obj_align(list, LV_ALIGN_TOP_MID, 0, 55);

        // Vector para almacenar los libros
        std::vector<Book> books;

        // Recorrer los datos obtenidos y crear un objeto Book para cada libro
        for(JsonPair kv : doc.as<JsonObject>()) {
            String key = kv.key().c_str();
            String title = kv.value()["titulo"].as<String>();
            long long timestamp = kv.value()["ultima_modificacion"].as<long long>();

            Book book = {title, key, timestamp};
            books.push_back(book); // va añadiendo los libros al vector
        }

        // Ordenar los libros por timestamp en orden descendente
        std::sort(books.begin(), books.end(), [](const Book& a, const Book& b) {
            return a.timestamp > b.timestamp;
        });

        // Mostrar los libros en la lista
        for (const Book& book : books) {
            char * titleCopy = new char[book.title.length() + 1]; // Reservar espacio para una copia del título del libro, incluyendo espacio para el carácter nulo de terminación
            strcpy(titleCopy, book.title.c_str()); // Copiar el título del libro a la nueva memoria reservada
            char * keyCopy = new char[book.key.length() + 1]; // Reservar espacio para una copia de la clave del libro, incluyendo espacio para el carácter nulo de terminación
            strcpy(keyCopy, book.key.c_str()); // Copiar la clave del libro a la nueva memoria reservada
            lv_obj_t * btn = lv_list_add_btn(list, "\xF3\xB1\x81\xAF", titleCopy); // Crear un botón en la lista con el título del libro

            // Configurar el estilo del botón
            lv_obj_t * label = lv_obj_get_child(btn, 0);
            lv_obj_set_style_text_font(label, &bigger_symbols, 0);

            lv_obj_set_style_text_font(btn, &ubuntu_regular_16, 0);
            lv_obj_set_style_text_color(btn, lv_color_black(), 0);
            lv_obj_set_style_bg_color(btn, lv_color_hex(0xCBECFF), 0);

            // Agregar un manejador de eventos al botón para que llame a go_to_screen2_tab2 cuando se haga clic en él
            lv_obj_add_event_cb(btn, go_to_screen2_tab2, LV_EVENT_CLICKED, keyCopy); // Use the char* version of the key
        }
    } else {
        Serial.println("Fallo al recuperar datos.");
    }

