ainhoamm04/Asistente_lectura_ESP32-S3/src/main.cpp
}

// Manejador de eventos para el botón que cambia a la pantalla secundaria de tab2
void go_to_screen2_tab2(lv_event_t * e) {
    // Obtener la pantalla principal (donde están las tabs)
    lv_obj_t * main_screen = lv_scr_act();
    scr_principal = main_screen;

    // Obtener la clave del libro desde el evento
    /* Recupera los datos de usuario asociados a un evento y los convierte a una cadena de caracteres
       Primero, se realiza un casting estático para convertir el puntero a void devuelto por lv_event_get_user_data(e) a un puntero a char
       Luego, se utiliza el constructor de std::string para convertir el puntero a char en una cadena de caracteres de C++
       El resultado se almacena en la variable 'key'*/
    std::string key = std::string(static_cast<char*>(lv_event_get_user_data(e)));

    // Llamar a la función para crear la segunda pantalla pasando la key del libro seleccionado de la lista
    create_second_screen_tab2(main_screen, key);
}


// Crear la pantalla secundaria de la pestaña 2 con los detalles del libro seleccionado
void create_second_screen_tab2(lv_obj_t * parent, const std::string& key) {
    // Crear una nueva pantalla y cargarla
    lv_obj_t * screen2 = lv_obj_create(NULL);
    lv_obj_set_size(screen2, LV_HOR_RES, LV_VER_RES);
    lv_obj_set_style_bg_color(screen2, lv_color_hex(0xCBECFF), 0);
    lv_scr_load(screen2);

    // Decoración con símbolos arriba y abajo de la pantalla
    lv_obj_t * label_symbols1 = lv_label_create(screen2);
    std::string symbols = "";
    for(int i = 0; i < 9; i++) {
        symbols += " \xEE\xB7\xA2  ";
    }
    lv_label_set_text(label_symbols1, symbols.c_str());
    lv_obj_set_style_text_font(label_symbols1, &ubuntu_regular_16, 0);
    lv_obj_set_pos(label_symbols1, 0, 10);

    lv_obj_t * label_symbols2 = lv_label_create(screen2);
    lv_label_set_text(label_symbols2, symbols.c_str());
    lv_obj_set_style_text_font(label_symbols2, &ubuntu_regular_16, 0);
    lv_obj_set_pos(label_symbols2, 0, 290);

    int posY = -120;

    // Obtener los datos del libro seleccionado de la base de datos
    DynamicJsonDocument doc = get_book_data(key);
    if (!doc.isNull()) {
        String titulo = doc["titulo"].as<String>();
        String autor = doc["autor"].as<String>();
        int paginas_total = doc["paginas_total"].as<int>();
        int pagina_actual = doc["pagina_actual"].as<int>();

        // Crear las etiquetas y mostrar los datos del libro
        lv_obj_t * label_title = lv_label_create(screen2);
        lv_label_set_long_mode(label_title, LV_LABEL_LONG_SCROLL_CIRCULAR);
        lv_obj_set_width(label_title, 225);
        lv_label_set_text(label_title, titulo.c_str());
        lv_obj_set_style_text_font(label_title, &bigger_symbols, 0);
        lv_obj_set_style_text_align(label_title, LV_TEXT_ALIGN_CENTER, 0);
        lv_obj_align(label_title, LV_ALIGN_CENTER, 0, posY += 30);

        lv_obj_t * label_author = lv_label_create(screen2);
        lv_label_set_long_mode(label_author, LV_LABEL_LONG_WRAP);
        lv_obj_set_width(label_author, 225);
        lv_label_set_text(label_author, ("Autor: " + autor).c_str());
        lv_obj_set_style_text_font(label_author, &ubuntu_regular_16, 0);
        lv_obj_set_style_text_align(label_author, LV_TEXT_ALIGN_CENTER, 0);
        lv_obj_align(label_author, LV_ALIGN_CENTER, 0, posY += 40);

        lv_obj_t * label_total_pages = lv_label_create(screen2);
        lv_label_set_long_mode(label_total_pages, LV_LABEL_LONG_WRAP);
        lv_obj_set_width(label_total_pages, 225);
        lv_label_set_text(label_total_pages, (String(paginas_total) + " páginas en total").c_str());
        lv_obj_set_style_text_font(label_total_pages, &ubuntu_italic_16, 0);
        lv_obj_set_style_text_align(label_total_pages, LV_TEXT_ALIGN_CENTER, 0);
        lv_obj_align(label_total_pages, LV_ALIGN_CENTER, 0, posY += 25);

        lv_obj_t * label_current_page = lv_label_create(screen2);
        lv_label_set_long_mode(label_current_page, LV_LABEL_LONG_WRAP);
        lv_obj_set_width(label_current_page, 225);
        lv_label_set_text(label_current_page, ("Vas por la página: " + String(pagina_actual)).c_str());;
        lv_obj_set_style_text_font(label_current_page, &ubuntu_bold_16, 0);
        lv_obj_set_style_text_align(label_current_page, LV_TEXT_ALIGN_CENTER, 0);
        lv_obj_align(label_current_page, LV_ALIGN_CENTER, 0, posY += 25);
    } else {
        Serial.println("Fallo al recuperar datos de Firebase.");
    }

    // Botón con símbolo para volver a la pantalla principal de la pestaña 2
    lv_obj_t * symbol = lv_label_create(screen2);
    lv_label_set_text(symbol, "\xF3\xB0\xA9\x88");
    lv_obj_set_style_text_font(symbol, &bigger_symbols, 0);

    create_button(screen2, symbol, BUTTON_STYLE_BLUE, back_to_main_menu, 95, 210);
}






//--------------------------------------PESTAÑA 3---------------------------------------------------
// Pantalla principal de la pestaña 3 (es estática)
void tab3_content(lv_obj_t * parent) {
    // Título
    general_title(parent, "ESCANEAR LIBRO", TITLE_STYLE_ORANGE);

    // Texto explicativo
    lv_obj_t * label = lv_label_create(parent);
    lv_label_set_long_mode(label, LV_LABEL_LONG_WRAP);
    lv_label_set_text(label, "¿Quieres actualizar la página en la que te has quedado?\n\nPincha en el botón para abrir la cámara y escanear el libro");
    lv_obj_set_style_text_font(label, &ubuntu_regular_16, 0);
    lv_obj_set_width(label, 220);
    lv_obj_set_style_text_align(label, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_align(label, LV_ALIGN_CENTER, 0, -10);

    // Botón con símbolo para ir a la pantalla secundaria de la pestaña 3 (escanear QR)
    lv_obj_t * symbol = lv_label_create(parent);
    lv_label_set_text(symbol, "\xF3\xB0\x84\x84");
    lv_obj_set_style_text_font(symbol, &bigger_symbols, 0);

    create_button(parent, symbol, BUTTON_STYLE_ORANGE, go_to_screen2_tab3, 75, 190);
}


// Manejador de eventos para el botón que cambia a la pantalla secundaria de tab3
void go_to_screen2_tab3(lv_event_t * e) {
    lv_obj_t * main_screen = lv_scr_act(); // Obtener la pantalla principal (donde están las tabs)
    scr_principal = main_screen; // Guardar la pantalla principal en una variable global
    create_second_screen_tab3(main_screen); // Cargar la pantalla secundaria (donde se escanea el QR)
}


// Función para crear la pantalla secundaria de la pestaña 3 (escanear QR)
void create_second_screen_tab3(lv_obj_t * parent) {
    // Crear una nueva pantalla y cargarla
    lv_obj_t * screen2 = lv_obj_create(NULL);
    lv_obj_set_size(screen2, LV_HOR_RES, LV_VER_RES);
    lv_obj_set_style_bg_color(screen2, lv_color_hex(0xFFCE7E), 0);
    lv_scr_load(screen2);

