ainhoamm04/Asistente_lectura_ESP32-S3/src/main.cpp
    // Activar el lector de códigos QR
    reader.begin();
    Serial.println("Begin ESP32QRCodeReader");

    // Verificar si la tarea ya existe antes de intentar crearla
    if (qrCodeTaskHandle == NULL) {
        // Inicia la tarea de escaneo de códigos QR
        Serial.println("Iniciando tarea de escaneo de QR");
        create_qr_task();
    } else {
        Serial.println("La tarea de escaneo de QR ya estaba en ejecucion");
        stop_qr_task();
        create_qr_task();
    }

    // Crear etiquetas con texto y estilos
    lv_obj_t * label1 = lv_label_create(screen2);
    lv_label_set_long_mode(label1, LV_LABEL_LONG_WRAP);
    lv_label_set_recolor(label1, true);
    lv_label_set_text(label1, "#FF7C00 Muestra el QR del libro a la #FF7C00 cámara#");
    lv_obj_set_style_text_font(label1, &ubuntu_bold_16, 0);
    lv_obj_set_width(label1, 230);
    lv_obj_set_style_text_align(label1, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_align(label1, LV_ALIGN_CENTER, 0, -95);

    // Símbolos decorativos arriba y abajo de la pantalla en cada esquina
    lv_obj_t * label2 = lv_label_create(screen2);
    lv_label_set_recolor(label2, true);
    lv_label_set_text(label2, (String("#FF7C00  \xEE\xAB\x9A                     #" "#FF7C00          \xEE\xAA\xA4#")).c_str());
    lv_obj_set_style_text_font(label2, &bigger_symbols, 0);
    lv_obj_set_pos(label2, 0, 0);

    lv_obj_t * label3 = lv_label_create(screen2);
    lv_label_set_recolor(label3, true);
    lv_label_set_text(label3, (String("#FF7C00  \xEE\xAA\xA4                      #" "#FF7C00         \xEE\xAB\x9A#")).c_str());
    lv_obj_set_style_text_font(label3, &bigger_symbols, 0);
    lv_obj_set_pos(label3, 0, 290);

    // Imagen explicativa
    show_image(screen2);

    // Botón con símbolo para volver a la pantalla principal de la pestaña 3 (si no se desea escanear ningún libro)
    lv_obj_t * symbol = lv_label_create(screen2);
    lv_label_set_text(symbol, "\xF3\xB0\xA9\x88");
    lv_obj_set_style_text_font(symbol, &bigger_symbols, 0);

    create_button(screen2, symbol, BUTTON_STYLE_ORANGE, back_to_main_menu, 95, 340);
}


// Crear la tarea de escaneo de QR
void create_qr_task(void) {
    if (qr_task_flag == 0) {
        qr_task_flag = 1;
        xTaskCreate(onQrCodeTask, "onQrCode", 4 * 1024, NULL, 4, &qrCodeTaskHandle);
    } else {
        Serial.println("onQrCodeTask is running...");
    }
}


// Detener la tarea de escaneo de QR (espera hasta que la tarea se elimine)
void stop_qr_task(void) {
    if (qr_task_flag == 1) {
        qr_task_flag = 0;

        while (1) {
            if (eTaskGetState(qrCodeTaskHandle) == eDeleted) {
                break;
            }
            vTaskDelay(100 / portTICK_PERIOD_MS);
        }
        Serial.println("onQrCodeTask deleted!");
    }
}


// Escanear el código QR, decodificarlo y almacenar el contenido en una variable global
void onQrCodeTask(void *pvParameters) {
    Serial.println("Iniciando escaneo de QR");

    struct QRCodeData qrCodeData;

    qrCodeContentGlobal = ""; // Limpia de la variable global

    //strip.setLedColorData(0, 255, 255, 255); // Color blanco
    //strip.show(); // Actualiza los LEDs

    while (qr_task_flag) {
        // Si se recibe un código QR, decodifica y almacena el contenido en la variable global
        if (reader.receiveQrCode(&qrCodeData, 100)) {
            Serial.println("Found QRCode");

            // Si el código QR es válido, lo guarda en la variable global y
            if (qrCodeData.valid) {
                Serial.print("Payload: ");
                Serial.println((const char *)qrCodeData.payload);

                // Guarda el contenido del código QR en la variable global
                qrCodeContentGlobal = String((const char *)qrCodeData.payload);
                Serial.println("Contenido decodificado " + qrCodeContentGlobal);

                qrCodeFound = true;  // Para entrar en el condicional del loop y poder buscar en la base de datos y mostrar la siguiente pantalla
                qr_task_flag = 1; // Para detener la tarea

                //strip.setLedColorData(0, 0, 0, 0); // Apaga el LED
                //strip.show(); // Actualiza los LEDs
            } else {
                Serial.print("Invalid: ");
                Serial.println((const char *)qrCodeData.payload);
            }
        }
    }
        vTaskDelete(qrCodeTaskHandle); // Elimina la tarea
}


// Buscar en la base de datos si existe el ISBN decodificado del código QR
void searchIsbnInDatabase(const String& qrCodeContentGlobal) {
    // Guardar el contenido del código QR en una variable
    String qrIsbn = qrCodeContentGlobal;

    // De momento el libro no se ha encontrado
    book_found = false;

    // Crear un documento JSON dinámico para almacenar los datos de los libros
    DynamicJsonDocument doc = get_book_data("");

    // Recorrer todos los libros en la base de datos y comparar el ISBN de cada libro con el ISBN decodificado
    for(JsonPair kv : doc.as<JsonObject>()) {
        String isbn = kv.value()["isbn"].as<String>();
        if (isbn == qrIsbn) {
            book_found = true;

            // Almacenar la clave del libro para poder recuperar los datos del libro
            book_key = kv.key().c_str();

            // Almacenar los datos del libro encontrado
            title = kv.value()["titulo"].as<String>();
            author = kv.value()["autor"].as<String>();
            totalPages = kv.value()["paginas_total"].as<int>();
            currentPage = kv.value()["pagina_actual"].as<int>();

            /*
            Serial.println("Libro encontrado:");
            Serial.println("Titulo: " + title);
            Serial.println("Autor: " + author);
            Serial.println("Paginas totales: " + String(totalPages));
            Serial.println("Pagina actual: " + String(currentPage));*/
            break; // Salir del bucle si se encuentra el libro
        }
    }

    // Si no se encontró el libro, imprime "Libro no encontrado"
    if (!book_found) {
        Serial.println("Libro no encontrado");
    }

