ainhoamm04/Asistente_lectura_ESP32-S3/src/main.cpp
}


// Crear la pantalla de la pestaña 3 con los datos del libro escaneado para modificar la página actual
void create_keyboard_screen(lv_obj_t * parent) {
    // Crear una nueva pantalla y cargarla
    lv_obj_t * screen2 = lv_obj_create(NULL);
    lv_obj_set_size(screen2, LV_HOR_RES, LV_VER_RES);
    lv_obj_set_style_bg_color(screen2, lv_color_hex(0xFFCE7E), 0);
    lv_scr_load(screen2);

    if(book_found) {
        // Crear etiquetas con los datos del libro
        lv_obj_t * label1 = lv_label_create(screen2);
        lv_label_set_text(label1, title.c_str());
        lv_obj_set_style_text_font(label1, &ubuntu_bold_16, 0);
        lv_obj_align(label1, LV_ALIGN_TOP_MID, 0, 20);

        lv_obj_t * label2 = lv_label_create(screen2);
        lv_label_set_text(label2, author.c_str());
        lv_obj_set_style_text_font(label2, &ubuntu_regular_16, 0);
        lv_obj_align(label2, LV_ALIGN_TOP_MID, 0, 40);

        lv_obj_t * label3 = lv_label_create(screen2);
        lv_label_set_text(label3, (String(totalPages) + " páginas").c_str());
        lv_obj_set_style_text_font(label3, &ubuntu_italic_16, 0);
        lv_obj_align(label3, LV_ALIGN_TOP_MID, 0, 60);

        lv_obj_t * label4 = lv_label_create(screen2);
        lv_label_set_text(label4, ("Página anterior: " + String(currentPage)).c_str());
        lv_obj_set_style_text_font(label4, &ubuntu_regular_16, 0);
        lv_obj_align(label4, LV_ALIGN_TOP_MID, 0, 85);

        lv_obj_t * label5 = lv_label_create(screen2);
        lv_obj_align(label5, LV_ALIGN_TOP_MID, 0, 110);
        lv_label_set_text(label5, "¿En qué página te encuentras?");
        lv_obj_set_style_text_font(label5, &ubuntu_regular_16, 0);

        // Asociación de la etiqueta con el teclado numérico para que cuando el usuario introduzca el número de página, se actualice la etiqueta
        show_numeric_keyboard(label5);
    } else {
        // Si no se encuentra el libro
        lv_obj_t * label = lv_label_create(screen2);
        lv_label_set_text(label, "         LIBRO\n           NO\nENCONTRADO");
        lv_obj_set_style_text_font(label, &bigger_symbols, 0);
        lv_obj_align(label, LV_ALIGN_TOP_MID, 0, 40);

        // Crear botón para regresar a la pantalla principal de la pestaña 3
        lv_obj_t * symbol = lv_label_create(screen2);
        lv_label_set_text(symbol, "\xF3\xB0\xA9\x88");
        lv_obj_set_style_text_font(symbol, &bigger_symbols, 0);

        create_button(screen2, symbol, BUTTON_STYLE_ORANGE, back_to_main_menu, 95, 160);
    }
}


// Implementación de la función
void show_numeric_keyboard(lv_obj_t * label) {
    // Crear un objeto textarea para almacenar el número introducido por el usuario
    lv_obj_t * ta = lv_textarea_create(lv_scr_act());

    // Establecer el estilo del textarea
    static lv_style_t style_ta;
    lv_style_init(&style_ta);
    lv_style_set_bg_color(&style_ta, lv_color_hex(0xFFF0BE));
    lv_obj_add_style(ta, &style_ta, 0);
    lv_obj_set_size(ta, 100, 40);
    lv_obj_align(ta, LV_ALIGN_TOP_MID, 0, 140);

    // Establecer el texto inicial del textarea a una cadena vacía
    lv_textarea_set_text(ta, "");

    // Crear un mapa de teclado personalizado
    static const char * kb_map[] = {"1", "2", "3", LV_SYMBOL_OK, "\n",
                                    "4", "5", "6", LV_SYMBOL_NEW_LINE, "\n",
                                    "7", "8", "9", LV_SYMBOL_BACKSPACE, "\n",
                                    "0", LV_SYMBOL_LEFT, LV_SYMBOL_RIGHT, NULL
    };

    // Modificar el ancho de los botones
    static const lv_btnmatrix_ctrl_t kb_ctrl[] = {1, 1, 1, 2,
                                                  1, 1, 1, 2,
                                                  1, 1, 1, 2,
                                                  3, 1, 1
    };

    // Crear un teclado numérico personalizado
    lv_obj_t * kb = lv_keyboard_create(lv_scr_act());
    lv_obj_set_size(kb, 240, 130);

    // Establecer el mapa de teclado personalizado y el modo de teclado
    lv_keyboard_set_map(kb, LV_KEYBOARD_MODE_USER_1, kb_map, kb_ctrl);
    lv_keyboard_set_mode(kb, LV_KEYBOARD_MODE_USER_1);
    lv_keyboard_set_textarea(kb, ta);

    // Establecer el estilo del teclado
    static lv_style_t style_kb;
    lv_style_init(&style_kb);
    lv_style_set_bg_color(&style_kb, lv_color_hex(0xFFF0BE));
    lv_obj_add_style(kb, &style_kb, 0);

    // Registrar la función de devolución de llamada para el evento LV_EVENT_READY
    lv_obj_add_event_cb(kb, keyboard_event_cb, LV_EVENT_READY, label);
}


// Manejar la entrada del usuario en el teclado numérico
// Actualizar la página actual del libro en la base de datos y en la interfaz de usuario
// Limpiar la pantalla
void keyboard_event_cb(lv_event_t * e) {
    // Obtener el teclado, textarea y etiqueta asociados con el evento
    lv_obj_t * kb = lv_event_get_target(e);
    lv_obj_t * ta = lv_keyboard_get_textarea(kb);
    lv_obj_t * label = (lv_obj_t *)lv_event_get_user_data(e);

    // Verificar si el evento es LV_EVENT_READY
    if(lv_event_get_code(e) == LV_EVENT_READY) {
        // Obtener el número de página introducido por el usuario (convertir cadena de caracteres a un int)
        int number = atoi(lv_textarea_get_text(ta));

        // El valor máximo posible a introducir es el máximo de páginas que tiene el libro
        int max_value = totalPages;

        // Verificar si el número introducido es mayor que el número máximo de páginas
        if(number > max_value) {
            char max_value_str[32];
            sprintf(max_value_str, "%d", max_value); // Convertir el número máximo a una cadena de caracteres
            lv_textarea_set_text(ta, max_value_str);
            return;
        }

        // Actualizar la variable de página correspondiente al libro actual
        currentPage = number;

        // Actualizar el valor de currentPage en la base de datos
        update_current_page(book_key.c_str(), currentPage);

        // Actualizar la etiqueta con el nuevo valor de la página actual
        char buffer[32];
        sprintf(buffer, "Página actual: %d", number);
        lv_label_set_text(label, buffer);

