ainhoamm04/Asistente_lectura_ESP32-S3/src/main.cpp
        // Limpiar la pantalla
        lv_obj_del(kb);
        lv_obj_del(ta);

        // Crear botón para regresar a la pantalla principal de la pestaña 3
        lv_obj_t * symbol = lv_label_create(lv_scr_act());
        lv_label_set_text(symbol, "\xF3\xB0\xA9\x88");
        lv_obj_set_style_text_font(symbol, &bigger_symbols, 0);

        create_button(lv_scr_act(), symbol, BUTTON_STYLE_ORANGE, back_to_main_menu, 95, 160);
    }
}






//--------------------------------------PESTAÑA 4---------------------------------------------------
std::vector<std::string> book_keys; // Array para almacenar las claves de los libros (array de cadenas de texto)
int max_pages = 0;
String max_pages_book_title;

// Pantalla principal de la pestaña 4 (es dinámica y está sincronizada con la base de datos)
void tab4_content(lv_obj_t * parent) {
    // Título
    general_title(parent, "MIS ESTADÍSTICAS", TITLE_STYLE_GREEN);

    // Obtener los datos de los libros de la base de datos
    DynamicJsonDocument doc = get_book_data();

    // Variable para almacenar el total de páginas leídas
    int total_pages = 0;

    // Vector para almacenar los libros
    std::vector<Book> books;

    // Crear contenedores para cada estado de los libros (empezado, sin empezar, finalizado)
    lv_obj_t * container_unstarted = lv_obj_create(parent);
    lv_obj_align(container_unstarted, LV_ALIGN_OUT_TOP_LEFT, 0, 290);
    lv_obj_set_size(container_unstarted, 210, 200);
    lv_obj_set_style_bg_color(container_unstarted, lv_color_hex(0xD7ECD5), LV_PART_MAIN);
    lv_obj_set_style_border_color(container_unstarted, lv_color_hex(0x25B619), LV_PART_MAIN);
    lv_obj_set_style_border_width(container_unstarted, 2, LV_PART_MAIN);

    lv_obj_t * container_in_progress = lv_obj_create(parent);
    lv_obj_align(container_in_progress, LV_ALIGN_OUT_TOP_LEFT, 0, 565);
    lv_obj_set_size(container_in_progress, 210, 200);
    lv_obj_set_style_bg_color(container_in_progress, lv_color_hex(0xD7ECD5), LV_PART_MAIN);
    lv_obj_set_style_border_color(container_in_progress, lv_color_hex(0x25B619), LV_PART_MAIN);
    lv_obj_set_style_border_width(container_in_progress, 2, LV_PART_MAIN);

    lv_obj_t * container_finished = lv_obj_create(parent);
    lv_obj_align(container_finished, LV_ALIGN_OUT_TOP_LEFT, 0, 855);
    lv_obj_set_size(container_finished, 210, 200);
    lv_obj_set_style_bg_color(container_finished, lv_color_hex(0xD7ECD5), LV_PART_MAIN);
    lv_obj_set_style_border_color(container_finished, lv_color_hex(0x25B619), LV_PART_MAIN);
    lv_obj_set_style_border_width(container_finished, 2, LV_PART_MAIN);

    // Crear etiquetas para cada contenedor
    lv_obj_t * label_unstarted = lv_label_create(container_unstarted);
    lv_label_set_text(label_unstarted, "LIBROS SIN EMPEZAR");
    lv_obj_set_style_text_font(label_unstarted, &ubuntu_bold_16, 0);
    lv_obj_align(label_unstarted, LV_ALIGN_TOP_LEFT, 0, 0);

    lv_obj_t * label_in_progress = lv_label_create(container_in_progress);
    lv_label_set_text(label_in_progress, "LIBROS A MEDIAS");
    lv_obj_set_style_text_font(label_in_progress, &ubuntu_bold_16, 0);
    lv_obj_align(label_in_progress, LV_ALIGN_TOP_LEFT, 0, 0);

    lv_obj_t * label_finished = lv_label_create(container_finished);
    lv_label_set_text(label_finished, "LIBROS FINALIZADOS");
    lv_obj_set_style_text_font(label_finished, &ubuntu_bold_16, 0);
    lv_obj_align(label_finished, LV_ALIGN_TOP_LEFT, 0, 0);

    // Contadores para cada estado de los libros
    int count_unstarted = 0;
    int count_in_progress = 0;
    int count_finished = 0;

    // Recorrer los datos obtenidos y crear un objeto Book para cada libro
    for(JsonPair kv : doc.as<JsonObject>()) {
        int current_pages = kv.value()["pagina_actual"].as<int>();
        int total_pages_book = kv.value()["paginas_total"].as<int>();
        String title = kv.value()["titulo"].as<String>();
        String key = kv.key().c_str();
        long long timestamp = kv.value()["ultima_modificacion"].as<long long>();

        Book book = {title, key, timestamp}; // Crear un objeto Book con los datos del libro
        books.push_back(book); // Añadir el libro al vector

        total_pages += current_pages; // Suma las páginas actuales al total

        // Actualizar el libro con más páginas leídas
        if(current_pages > max_pages) {
            max_pages = current_pages;
            max_pages_book_title = title;
        }

        // Crear una etiqueta para mostrar el estado de cada libro
        lv_obj_t * status_label = NULL;
        String status_label_text = title;

        // Comprobar estado de cada libro
        if(current_pages == total_pages_book) {
            status_label = lv_label_create(container_finished);
            lv_obj_align(status_label, LV_ALIGN_TOP_LEFT, 0, 25 * (count_finished + 1));
            count_finished++;
        } else if(current_pages == 0) {
            status_label = lv_label_create(container_unstarted);
            lv_obj_align(status_label, LV_ALIGN_TOP_LEFT, 0, 25 * (count_unstarted + 1));
            count_unstarted++;
        } else {
            float percentage_read = float(current_pages) * 100 / total_pages_book;
            status_label_text += " (" + String(percentage_read) + "% leído)";
            status_label = lv_label_create(container_in_progress);
            lv_obj_align(status_label, LV_ALIGN_TOP_LEFT, 0, 25 * (count_in_progress + 1));
            count_in_progress++;
        }

        // Configurar la etiqueta con el título del libro
        lv_label_set_text(status_label, status_label_text.c_str());
        lv_obj_set_style_text_font(status_label, &ubuntu_regular_16, 0);
    }

    // Ordenar los libros por timestamp en orden descendente
    std::sort(books.begin(), books.end(), [](const Book& a, const Book& b) {
        return a.timestamp > b.timestamp;
    });

    // El libro más reciente es el primero en el vector
    String most_recent_book_title = books[0].title;

    lv_obj_t * label1 = lv_label_create(parent);
    lv_label_set_long_mode(label1, LV_LABEL_LONG_WRAP);
    lv_label_set_text(label1, "Libro actual");
    lv_obj_set_style_text_font(label1, &ubuntu_bold_16, 0);
    lv_obj_set_width(label1, 230);
    lv_obj_set_style_text_align(label1, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_align(label1, LV_ALIGN_CENTER, 0, -65);

    lv_obj_t * label11 = lv_label_create(parent);
    lv_label_set_long_mode(label11, LV_LABEL_LONG_SCROLL_CIRCULAR);
    String label1_text = most_recent_book_title;
    lv_label_set_text(label11, label1_text.c_str());
    lv_obj_set_style_text_font(label11, &ubuntu_regular_16, 0);
    lv_obj_set_width(label11, 230);
    lv_obj_set_style_text_align(label11, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_align(label11, LV_ALIGN_CENTER, 0, -45);

    // Create a label to display the book with the most pages read
    lv_obj_t * label2 = lv_label_create(parent);
    lv_label_set_long_mode(label2, LV_LABEL_LONG_WRAP);
    lv_label_set_text(label2, "Libro con más páginas leídas");
    lv_obj_set_style_text_font(label2, &ubuntu_bold_16, 0);
    lv_obj_set_width(label2, 230);
    lv_obj_set_style_text_align(label2, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_align(label2, LV_ALIGN_CENTER, 0, -12);

    lv_obj_t * label22 = lv_label_create(parent);
    lv_label_set_long_mode(label22, LV_LABEL_LONG_SCROLL_CIRCULAR);
    String label2_text = max_pages_book_title + " (" + String(max_pages) + " páginas)";
    lv_label_set_text(label22, label2_text.c_str());
    lv_obj_set_style_text_font(label22, &ubuntu_regular_16, 0);
    lv_obj_set_width(label22, 230);
    lv_obj_set_style_text_align(label22, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_align(label22, LV_ALIGN_CENTER, 0, 8);

    // Create a label to display the total pages read
    lv_obj_t * label3 = lv_label_create(parent);
    lv_label_set_long_mode(label3, LV_LABEL_LONG_WRAP);
    lv_label_set_text(label3, "Total de páginas leídas (entre todos los libros)");
    lv_obj_set_style_text_font(label3, &ubuntu_bold_16, 0);
    lv_obj_set_width(label3, 230);
    lv_obj_set_style_text_align(label3, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_align(label3, LV_ALIGN_CENTER, 0, 50);

    lv_obj_t * label33 = lv_label_create(parent);
    lv_label_set_long_mode(label33, LV_LABEL_LONG_WRAP);
    String label3_text = String(total_pages) + " páginas";
    lv_label_set_text(label33, label3_text.c_str());
    lv_obj_set_style_text_font(label33, &ubuntu_regular_16, 0);
    lv_obj_set_width(label33, 230);
    lv_obj_set_style_text_align(label33, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_align(label33, LV_ALIGN_CENTER, 0, 80);

    // Botón para ir desplazándose más facilmente por la pantalla hacia abajo
    lv_obj_t * down_button1 = lv_btn_create(parent);
    lv_obj_set_size(down_button1, 20, 20);
    lv_obj_set_pos(down_button1, 90, 230);
    lv_obj_add_event_cb(down_button1, event_handler_scroll1, LV_EVENT_CLICKED, parent);

