ainhoamm04/Asistente_lectura_ESP32-S3/src/main.cpp
    //Botón para desplazar pantalla hacia arriba automáticamente
    lv_obj_t * up_button = lv_btn_create(screen2);
    lv_obj_set_size(up_button, 20, 20);
    lv_obj_set_pos(up_button, 110, 330);
    lv_obj_add_event_cb(up_button, event_handler_top, LV_EVENT_CLICKED, screen2);

    // Crear una etiqueta para el símbolo de arriba y añadir al botón
    lv_obj_t * up_symbol = lv_label_create(up_button);
    lv_obj_center(up_symbol);
    lv_label_set_text(up_symbol, LV_SYMBOL_UP);


    // Crear estilo para los símbolos de arriba y abajo
    static lv_style_t style_symbol_up_down;
    lv_style_init(&style_symbol_up_down);
    lv_style_set_text_color(&style_symbol_up_down, lv_color_black());
    lv_obj_add_style(down_symbol, &style_symbol_up_down, 0);
    lv_obj_add_style(up_symbol, &style_symbol_up_down, 0);

    // Establecer el estilo del botón para que coincida con el color de fondo
    static lv_style_t style_btn_up_down;
    lv_style_init(&style_btn_up_down);
    lv_style_set_bg_color(&style_btn_up_down, lv_color_hex(0xCEF2D8));
    lv_obj_add_style(down_button, &style_btn_up_down, 0);
    lv_obj_add_style(up_button, &style_btn_up_down, 0);

    // Crear una etiqueta para la leyenda
    lv_obj_t * label = lv_label_create(container);
    lv_label_set_text(label, "-----------LEYENDA-----------");
    lv_obj_set_style_text_font(label, &ubuntu_bold_16, 0);
    lv_obj_set_pos(label, 0, 0);

    // Para cada libro, calcular el porcentaje de páginas leídas y añadir una serie al gráfico
    for(JsonPair kv : doc.as<JsonObject>()) {
        String book_key = kv.key().c_str(); // Obtener la clave del libro
        book_keys.push_back(book_key.c_str()); // Almacenar la clave del libro para su uso posterior
        JsonObject libro = kv.value().as<JsonObject>(); // Obtener el valor del libro como un objeto JSON

        // Calcular el porcentaje de páginas leídas
        int paginas_total = libro["paginas_total"].as<int>();
        int pagina_actual = libro["pagina_actual"].as<int>();
        float porcentaje = ((float)pagina_actual / paginas_total) * 100;

        // Añadir el porcentaje a la serie del gráfico
        lv_chart_set_next_value(chart, ser, porcentaje);

        // Crear una etiqueta para la clave y añadirla al contenedor de leyenda
        lv_obj_t * label_key = lv_label_create(container);
        lv_label_set_text(label_key, book_key.c_str());
        lv_obj_set_style_text_font(label_key, &ubuntu_bold_16, 0);
        lv_obj_set_pos(label_key, 0, label_y_pos);

        // Crear una etiqueta para el título del libro y añadirla al contenedor de leyenda
        lv_obj_t * label_title = lv_label_create(container);
        lv_label_set_text(label_title, libro["titulo"].as<const char*>());
        lv_obj_set_style_text_font(label_title, &ubuntu_regular_16, 0);
        lv_obj_set_pos(label_title, 0, label_y_pos + 20);

        label_y_pos += 45;

        book_index++;
    }

    // Actualizar el gráfico
    lv_chart_refresh(chart);

    // Crear un botón para regresar a la pantalla principal de la pestaña 4
    lv_obj_t * symbol = lv_label_create(screen2);
    lv_label_set_text(symbol, "\xF3\xB0\xA9\x88");
    lv_obj_set_style_text_font(symbol, &bigger_symbols, 0);

    create_button(screen2, symbol, BUTTON_STYLE_GREEN, back_to_main_menu, 95, 580);

    lv_obj_t * space = lv_label_create(screen2);
    lv_label_set_text(space, "\n\n");
    lv_obj_align(space, LV_ALIGN_TOP_MID, 0, 590);
}


// Manejador de eventos para el botón que cambia a la pantalla secundaria de tab4
void go_to_screen2_tab4(lv_event_t * e) {
    lv_obj_t * main_screen = lv_scr_act(); // Obtén la pantalla principal (donde están las tabs)
    scr_principal = main_screen;
    create_second_screen_tab4(main_screen);
}


// Manejador de eventos para el botón de desplazar la pantalla hacia abajo
void event_handler_bottom(lv_event_t * e) {
    const lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_CLICKED) {
        lv_obj_t * screen2 = (lv_obj_t *)lv_event_get_user_data(e); // Get the screen object from the user data
        lv_obj_scroll_to_y(screen2, lv_obj_get_height(screen2), LV_ANIM_ON); // Scroll to the bottom of the screen
    }
}


// Manejador de eventos para el botón de desplazar la pantalla hacia arriba
void event_handler_top(lv_event_t * e) {
    const lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_CLICKED) {
        lv_obj_t * screen2 = (lv_obj_t *)lv_event_get_user_data(e); // Get the screen object from the user data
        lv_obj_scroll_to_y(screen2, 0, LV_ANIM_ON); // Scroll to the top of the screen
    }
}


// Función para dibujar las etiquetas del eje X (las claves de los libros)
void draw_label_x_axis(lv_event_t * e) {
    lv_obj_draw_part_dsc_t * dsc = lv_event_get_draw_part_dsc(e);
    if(!lv_obj_draw_part_check_type(dsc, &lv_chart_class, LV_CHART_DRAW_PART_TICK_LABEL)) return;

    if(dsc->id == LV_CHART_AXIS_PRIMARY_X && dsc->text) {
        lv_snprintf(dsc->text, dsc->text_length, "%s", book_keys[dsc->value % book_keys.size()].c_str());
    }
}


// Función para dibujar las etiquetas del eje Y (los porcentajes de páginas leídas)
void draw_label_y_axis(lv_event_t * e) {
    lv_obj_draw_part_dsc_t * dsc = lv_event_get_draw_part_dsc(e);
    if(!lv_obj_draw_part_check_type(dsc, &lv_chart_class, LV_CHART_DRAW_PART_TICK_LABEL)) return;

    if(dsc->id == LV_CHART_AXIS_PRIMARY_Y && dsc->text) {
        lv_snprintf(dsc->text, dsc->text_length, "%d%%", dsc->value);
    }
}